### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_network_connectivity_group.dev-core-center will be created
  + resource "google_network_connectivity_group" "dev-core-center" {
      + create_time      = (known after apply)
      + description      = "NCC DEV center group - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + hub              = (known after apply)
      + id               = (known after apply)
      + name             = "center"
      + project          = "chspoc-prod-iac-core-0"
      + route_table      = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid              = (known after apply)
      + update_time      = (known after apply)
    }

  # google_network_connectivity_group.dev-core-edge will be created
  + resource "google_network_connectivity_group" "dev-core-edge" {
      + create_time      = (known after apply)
      + description      = "NCC DEV edge group - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + hub              = (known after apply)
      + id               = (known after apply)
      + name             = "edge"
      + project          = "chspoc-prod-iac-core-0"
      + route_table      = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid              = (known after apply)
      + update_time      = (known after apply)
    }

  # google_network_connectivity_hub.dev-hub will be created
  + resource "google_network_connectivity_hub" "dev-hub" {
      + create_time      = (known after apply)
      + description      = "NCC DEV Hub - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + export_psc       = (known after apply)
      + id               = (known after apply)
      + name             = "ncc-dev-hub"
      + policy_mode      = (known after apply)
      + preset_topology  = "STAR"
      + project          = "chspoc-dev-core"
      + routing_vpcs     = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)
    }

  # module.dev-core-project.google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "146457895233"
      + id                  = (known after apply)
      + name                = "chspoc-dev-core"
      + number              = (known after apply)
      + project_id          = "chspoc-dev-core"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.dev-core-project.google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/compute.serviceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/container.serviceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["dns"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/dns.serviceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["vmwareengine"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/vmwareengine.serviceAgent"
    }

  # module.dev-core-project.google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.dev-core-project.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "compute.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "container.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "dns.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "iap.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "logging.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "monitoring.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["vmwareengine.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "vmwareengine.googleapis.com"
    }

  # module.dev-core-project.google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-dev-core"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "container.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["dns.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "dns.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["iap.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "iap.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "monitoring.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "networkmanagement.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "networksecurity.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "servicenetworking.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["vmwareengine.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "vmwareengine.googleapis.com"
    }

  # module.dev-core-project.google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-dev-core"
      + service = "vpcaccess.googleapis.com"
    }

  # module.dev-transit-vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "dev-transit-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "chspoc-dev-core"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.dev-transit-vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "dev-transit-vpc-directpath-googleapis"
      + network                    = "dev-transit-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-core"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-transit-vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "dev-transit-vpc-private-googleapis"
      + network                    = "dev-transit-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-core"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-transit-vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "dev-transit-vpc-restricted-googleapis"
      + network                    = "dev-transit-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-dev-core"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.dev-transit-vpc.google_compute_subnetwork.subnetwork["us-central1/sn-transit-dev"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Default primary-region subnet for dev"
      + enable_flow_logs                 = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.68.0.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "sn-transit-dev"
      + network                          = "dev-transit-vpc"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "chspoc-dev-core"
      + purpose                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "stage_configs" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "tag_values" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*